# -*- coding: utf-8 -*-
"""
Created on Wed Jul 14 14:39:32 2021

@author: USER
"""

print("<歡迎進入蘋果管理系統>")
apple=[]
n1=int(input("最初蘋果數量："))
p1=int(input("一顆蘋果賣多少錢:"))
#進貨
p2=int(input("一顆蘋果的成本價:"))
n2=int(input("進多少顆蘋果:"))
t1=p2*n2
print("進貨成本:", t1)
#出貨
n3=int(input("賣多少顆蘋果:"))
t2=p1*n3
print("總收入:", t2)
    
#營業額統計(因為只有一筆交易所以省略"幾筆交易"，有新增"利潤")
print("賣了多少顆蘋果:",n3, "總收入:",t2,"進了多少蘋果:",n2,"總成本:",t1,"利潤:",t2-t1 )

#庫存統計
print("剩餘庫存:", n1+n2-n3)

#離開系統(因為沒有清單就不會有"離開"，所以用登記完畢代替)
print("<登記完畢>")
